Documents/СлужебнаяЗаписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СлужебнаяЗаписка</Name>
			<Comment>(Общ) Служебная записка</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаВозврат</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийПолучатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаВозврат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаВСмежнойБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАктаПриемкиТовараНаЭкспертизу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИнвойс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Погружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспертиза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоместо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СлужебнаяЗаписка/Ext/ManagerModule.bsl
// Функция формирует табличный документ с печатной формой накладной,
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//	ИЛИ выводит на экран пользователю
Функция ПечатьСлужебнаяЗаписка(ДокументСсылка, ВыводДокумента = Ложь) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;   
	
	Если НЕ ДокументСсылка.Отправлен Тогда 
		
		Сообщить("Документ не отправлен. Печать Служебной записки не возможна.!!", СтатусСообщения.ОченьВажное);
		Возврат ТабличныйДокумент;  
		
	КонецЕсли;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СлужебнаяЗаписка";
	
	Макет = ПолучитьМакет("СлужебнаяЗаписка"); 
	
	Область = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос;
	// Заполняется номер документа в случае отсутствия Номера Инвойса
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСлужебнаяЗаписка.Ссылка КАК ДокументСсылка,
	|	ДокументСлужебнаяЗаписка.Ссылка.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ДокументСлужебнаяЗаписка.Ссылка.НомерИнвойс = """"
	|			ТОГДА ДокументСлужебнаяЗаписка.Ссылка.Номер
	|		ИНАЧЕ ДокументСлужебнаяЗаписка.Ссылка.НомерИнвойс
	|	КОНЕЦ КАК НомерДокумента,
	|	ПРЕДСТАВЛЕНИЕ(ДокументСлужебнаяЗаписка.Получатель) КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(ДокументСлужебнаяЗаписка.Ответственный) КАК Инициатор
	|ПОМЕСТИТЬ ВТ_ДокументыПечати
	|ИЗ
	|	Документ.СлужебнаяЗаписка КАК ДокументСлужебнаяЗаписка
	|ГДЕ
	|	ДокументСлужебнаяЗаписка.Ссылка = &ОбъектСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПечати.ДокументСсылка КАК ДокументСсылка,
	|	ДокументыПечати.Дата КАК ДатаДокумента,
	|	ДокументыПечати.НомерДокумента КАК НомерДокумента,
	|	ДокументыПечати.Контрагент КАК Контрагент,
	|	ДокументыПечати.Инициатор КАК Инициатор,
	|	МАКСИМУМ(ТаблицаТранспортныеЕдиницы.НомерСтроки) КАК КолМест
	|ИЗ
	|	ВТ_ДокументыПечати КАК ДокументыПечати
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СлужебнаяЗаписка.ТранспортныеЕдиницы КАК ТаблицаТранспортныеЕдиницы
	|		ПО (ТаблицаТранспортныеЕдиницы.Ссылка = ДокументыПечати.ДокументСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыПечати.ДокументСсылка,
	|	ДокументыПечати.Дата,
	|	ДокументыПечати.НомерДокумента,
	|	ДокументыПечати.Контрагент,
	|	ДокументыПечати.Инициатор";
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ДокументСсылка);
	
	РезультатВыборка = Запрос.Выполнить().Выбрать();
		
	Пока РезультатВыборка.Следующий() Цикл
					
		Область.Параметры.Заполнить(РезультатВыборка);    
		
		Область.Параметры.ДатаПечати 	= Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy ""г.""'");  
		Область.Параметры.ДатаДокумента = Формат(РезультатВыборка.ДатаДокумента , "ДФ='dd.MM.yyyy ""г.""'");
		Область.Параметры.Инициатор 	= СокрЛП(РезультатВыборка.Инициатор);
		Область.Параметры.Филиал		= СокрЛП(Константы.База.Получить());
		Область.Параметры.Комментарий = СОКРЛП(РезультатВыборка.ДокументСсылка.Комментарий);
		
		ТабличныйДокумент.Вывести(Область);
				
	КонецЦикла;
	
	Если ВыводДокумента Тогда		
		
		ТабличныйДокумент.Показать(); 
		ТабличныйДокумент = Неопределено;
		
	КонецЕсли;

	Возврат ТабличныйДокумент;

КонецФункции // ПечатьСлужебнаяЗаписка() 

// Функция формирует табличный документ с печатной формой этикеток штрихкодов,
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//	ИЛИ выводит на экран пользователю
Функция ПечатьЭтикеток(ДокументСсылка, ВыводДокумента = Ложь, ШаблонМакет = "Этикетка") Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;  
	
	Если НЕ ДокументСсылка.Отправлен Тогда 
		
		Сообщить("Документ не отправлен. Печать этикеток не возможна.!!", СтатусСообщения.ОченьВажное);
		Возврат ТабличныйДокумент;  
		
	КонецЕсли;	

	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СлужебнаяЗапискаЭтикетка";
	
	МакетЭтикетка	= ПолучитьМакет(ШаблонМакет); 
	ОбластьЭтикетка = МакетЭтикетка.ПолучитьОбласть("ШтрихКод");  
	
	Эталон = Обработки.ПечатьЭтикеток.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	Получатель  = "Получ.:" + Строка(СокрЛП(ДокументСсылка.Получатель));
	Отправитель = "Отпр.:" + СокрЛП(Константы.База.Получить());
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",          	Окр(ОбластьЭтикетка.Рисунки.КартинкаШтрихкода.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",          	Окр(ОбластьЭтикетка.Рисунки.КартинкаШтрихкода.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод", 		"0");               
	ПараметрыШтрихкода.Вставить("ТипКода",         	4); // Code128
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", 	Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    	14);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТранспортныеЕдиницы.Грузоместо КАК Грузоместо
	|ИЗ
	|	Документ.СлужебнаяЗаписка.ТранспортныеЕдиницы КАК ТаблицаТранспортныеЕдиницы
	|ГДЕ
	|	ТаблицаТранспортныеЕдиницы.Ссылка = &ОбъектСсылка
	|";
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ДокументСсылка);
	
	ОбщееКоличествоСтр = Формат(ДокументСсылка.ТранспортныеЕдиницы.Количество(), "ЧГ=");
	НомСтр = 1;
	
	РезультатВыборка = Запрос.Выполнить().Выбрать();
	
	Пока РезультатВыборка.Следующий() Цикл   
		
		ПараметрыШтрихкода.Вставить("Штрихкод", СокрЛП(РезультатВыборка.Грузоместо));

		ОбластьЭтикетка.Рисунки.КартинкаШтрихкода.Картинка = ОбщегоНазначения.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		
		ОбластьЭтикетка.Параметры.Получатель  			= Получатель;	
		ОбластьЭтикетка.Параметры.Отправитель 			= Отправитель;
		ОбластьЭтикетка.Параметры.НомерДатаДокумента 	= "№" + ?(ЗначениеЗаполнено(ДокументСсылка.НомерИнвойс), Строка(ДокументСсылка.НомерИнвойс), 
		                              Строка(ДокументСсылка.Номер)) + " от " + Строка(Формат(ДокументСсылка.Дата, "ДФ='dd.MM.yy"" г.""'"));  
		ОбластьЭтикетка.Параметры.Нумерация = Строка(НомСтр) + " из " + ОбщееКоличествоСтр;
		НомСтр = НомСтр + 1;
		
		ТабличныйДокумент.Вывести(ОбластьЭтикетка);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
	КонецЦикла;
	
	ТабличныйДокумент.ПолеСверху 		= 0.1;
	ТабличныйДокумент.ПолеСлева 		= 1;
	ТабличныйДокумент.ПолеСнизу 		= 0.1;
	ТабличныйДокумент.ПолеСправа 		= 1;
	//ТабличныйДокумент.ВысотаСтраницы 	= 38;
	//ТабличныйДокумент.ШиринаСтраницы 	= 58;
	ТабличныйДокумент.АвтоМасштаб 		= Истина;
	
	Если ВыводДокумента Тогда		
		
		ТабличныйДокумент.Показать(); 
		ТабличныйДокумент = Неопределено;
		
	КонецЕсли;

	Возврат ТабличныйДокумент;
	
КонецФункции	

Функция ПолучитьКонтактнуюИнформацию(Получатель)

	СтруктураСКонтактнойИнформацией = Новый Структура("ЮрАдресКазани,ЮрАдресКонтрагента,ТелефонСлужебныйВодителя,ФактАдресКазани
	|,АдресДоставки,АдресПеревозчика,ТелефонКазани,ТелефонКонтрагента,АдресГрузоперевозчика,ТелефонГрузоперевозчика");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект В(&СписокОбъектов)
	|	И КонтактнаяИнформация.Тип В(&СписокТипов)
	|	И КонтактнаяИнформация.Вид В(&СписокВидов)";
	
	СписокОбъектов = Новый Массив;
	СписокОбъектов.Добавить(Получатель);
	//
	СписокТипов = Новый Массив;
	СписокТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.Адрес);
	СписокТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	//
	СписокВидов= Новый Массив;
	СписокВидов.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	СписокВидов.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	СписокВидов.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный);
	СписокВидов.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	СписокВидов.Добавить(Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	СписокВидов.Добавить(Справочники.ВидыКонтактнойИнформации.АдресГрузоперевозчика);
	СписокВидов.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	СписокВидов.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	СписокВидов.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	
	
	Запрос.УстановитьПараметр("СписокОбъектов",СписокОбъектов );
	Запрос.УстановитьПараметр("СписокТипов", СписокТипов);
	Запрос.УстановитьПараметр("СписокВидов", СписокВидов);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Вид = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента Тогда 
			СтруктураСКонтактнойИнформацией.Вставить("ФаксКонтрагента", Выборка.Представление);
		ИначеЕсли Выборка.Вид = Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента Тогда 
			СтруктураСКонтактнойИнформацией.Вставить("АдресДоставкиКонтрагента", Выборка.Представление);
		ИначеЕсли Выборка.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда 
			СтруктураСКонтактнойИнформацией.Вставить("ТелефонКонтрагента", Выборка.Представление);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураСКонтактнойИнформацией;	

КонецФункции

Функция  ПечатьАктаПриемаПередачи(ДокументСсылка, ВыводДокумента = Ложь) Экспорт 

	ТабличныйДокумент = Новый ТабличныйДокумент;   
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктПриемаПередачиТоваров";
	
	Макет = ПолучитьМакет("АктПриемаПередачиТоваров"); 
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.НомерДокумента = ДокументСсылка.Номер;
	ОбластьЗаголовок.Параметры.ДатаДокумента  = Формат(ДокументСсылка.Дата,"ДФ='dd.MM.yyyy ""г.""'");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	СтруктураКонтактнойИнформации = ПолучитьКонтактнуюИнформацию(ДокументСсылка.Получатель); 
	
	ОбластьПокупатель = Макет.ПолучитьОбласть("Покупатель"); 
	ОбластьПокупатель.Параметры.ПредставлениеПолучателя = СокрЛП(ДокументСсылка.Получатель.НаименованиеПолное);
	ОбластьПокупатель.Параметры.АдресГрузополучателя = СокрЛП(СтруктураКонтактнойИнформации.АдресДоставкиКонтрагента);
	ОбластьПокупатель.Параметры.ТелефонГрузополучателя = СокрЛП(СтруктураКонтактнойИнформации.ТелефонКонтрагента);
	ТабличныйДокумент.Вывести(ОбластьПокупатель);
	
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка"); 
	
	Для Каждого СтрокаТоварыЗаявки Из ДокументСсылка.ЗаявкаНаВозврат.Товары Цикл
		
		ОбластьСтрока.Параметры.НомерСтроки      = СтрокаТоварыЗаявки.НомерСтроки;
		ОбластьСтрока.Параметры.Производитель    = СокрЛП(СтрокаТоварыЗаявки.Номенклатура.Родитель.Наименование);
		ОбластьСтрока.Параметры.КодПроизводителя = СокрЛП(СтрокаТоварыЗаявки.Номенклатура.КодПроизводителя);
		ОбластьСтрока.Параметры.Наименование     = СокрЛП(СтрокаТоварыЗаявки.Номенклатура.Наименование);
		ОбластьСтрока.Параметры.Количество       = СтрокаТоварыЗаявки.Количество;
		
		ТабличныйДокумент.Вывести(ОбластьСтрока); 
		
	КонецЦикла;

	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.ИтогоМест = ДокументСсылка.ЗаявкаНаВозврат.Товары.Итог("Количество");
    ТабличныйДокумент.Вывести(ОбластьИтого);
	
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	ОбластьПодписи.Параметры.Отправитель = СокрЛП(Константы.ОсновнаяОрганизация.Получить().Наименование); 
	ОбластьПодписи.Параметры.Получатель  = СокрЛП(ДокументСсылка.Получатель.НаименованиеПолное);
	ТабличныйДокумент.Вывести(ОбластьПодписи);
	
	Если ВыводДокумента Тогда		
		
		ТабличныйДокумент.Показать(); 
		ТабличныйДокумент = Неопределено;
		
	КонецЕсли;

	Возврат ТабличныйДокумент;

КонецФункции

//Функция отправляет на согласование докуумент через WEB сервис GoodsReserve
//	Устанавливает реквизит "НомерИнвойс" при положительном ответе, при отрицательном выводит информациию пользователю
Функция ОтправитьДокументНаСогласование(ДокументСсылка) Экспорт    
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураПараметров	= Новый Структура;
	СтруктураПараметров.Вставить("ВидыТранзитныхПоставок", 		  "СлужебнаяЗаписка");
	СтруктураПараметров.Вставить("ИдентификаторГоловногоКонтрагента", СокрЛП(ДокументСсылка.Получатель.ГоловнойКонтрагент.КодМДМ));
	СтруктураПараметров.Вставить("ИдентификаторКонтрагента", СокрЛП(ДокументСсылка.Получатель.КодМДМ));
	СтруктураПараметров.Вставить("ИдентификаторГрузоотправителя", СокрЛП(Константы.КодФилиала.Получить())); 
	СтруктураПараметров.Вставить("Комментарий", 				  СокрЛП(ДокументСсылка.Комментарий));      
	СтруктураПараметров.Вставить("Номер", 						  СокрЛП(ДокументСсылка.Номер));      
	СтруктураПараметров.Вставить("Дата", 						  СокрЛП(ДокументСсылка.Дата));                                      
	СтруктураПараметров.Вставить("АвторСЗ", 					  СокрЛП(ДокументСсылка.Ответственный));
	СтруктураПараметров.Вставить("ТранспортныеЕдиницы",			  ДокументСсылка.ТранспортныеЕдиницы.ВыгрузитьКолонку("Грузоместо"));
	СтруктураПараметров.Вставить("Экспертиза", 					  ДокументСсылка.Экспертиза);
	
	Если ДокументСсылка.Экспертиза Тогда
		
		ТЗЗаявкаНаВозврат = Новый ТаблицаЗначений;
		ТЗЗаявкаНаВозврат.Колонки.Добавить("Номенклатура"); 
		ТЗЗаявкаНаВозврат.Колонки.Добавить("НоменклатураКодМДМ");
		ТЗЗаявкаНаВозврат.Колонки.Добавить("Артикул");
		ТЗЗаявкаНаВозврат.Колонки.Добавить("Количество");
		ТЗЗаявкаНаВозврат.Колонки.Добавить("Цена");
		ТЗЗаявкаНаВозврат.Колонки.Добавить("ЕдИзмКод");
		ТЗЗаявкаНаВозврат.Колонки.Добавить("НомерЗаявки");
		ТЗЗаявкаНаВозврат.Колонки.Добавить("ДатаЗаявки");
		ТЗЗаявкаНаВозврат.Колонки.Добавить("КомментарийЗаявки");
		ТЗЗаявкаНаВозврат.Колонки.Добавить("ЗаявкаНаВозвратГУИД");
		
		Для Каждого СтрокаТовары Из ДокументСсылка.ЗаявкаНаВозврат.Товары Цикл
			
			НоваяСтрокаЗаявкиНаВозврат                    = ТЗЗаявкаНаВозврат.Добавить();
			НоваяСтрокаЗаявкиНаВозврат.Номенклатура       = СтрокаТовары.Номенклатура;
			НоваяСтрокаЗаявкиНаВозврат.НоменклатураКодМДМ = СтрокаТовары.Номенклатура.КодМДМ;
			НоваяСтрокаЗаявкиНаВозврат.Артикул            = СтрокаТовары.Номенклатура.Артикул;
			НоваяСтрокаЗаявкиНаВозврат.Количество         = СтрокаТовары.Количество;
			НоваяСтрокаЗаявкиНаВозврат.Цена               = СтрокаТовары.Цена;
			НоваяСтрокаЗаявкиНаВозврат.ЕдИзмКод           = СтрокаТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;  		
			
		КонецЦикла;
		
		ТЗЗаявкаНаВозврат.ЗаполнитьЗначения(СокрЛП(ДокументСсылка.ЗаявкаНаВозврат.Номер),"НомерЗаявки");
		ТЗЗаявкаНаВозврат.ЗаполнитьЗначения(СокрЛП(ДокументСсылка.ЗаявкаНаВозврат.Дата),"ДатаЗаявки");
		ТЗЗаявкаНаВозврат.ЗаполнитьЗначения(СокрЛП(ДокументСсылка.ЗаявкаНаВозврат.Комментарий),"КомментарийЗаявки");
		ТЗЗаявкаНаВозврат.ЗаполнитьЗначения(СокрЛП(ДокументСсылка.ЗаявкаНаВозврат.УникальныйИдентификатор()),"ЗаявкаНаВозвратГУИД");
		
		СтруктураПараметров.Вставить("ТЗЗаявкаНаВозврат",  ТаблицуВМассив(ТЗЗаявкаНаВозврат)); 
		
		СтруктураПараметров.Вставить("ИдентификаторСклад", СокрЛП(Константы.ОсновнойСклад.Получить().КодМДМ)); 
		СтруктураПараметров.Вставить("КодФилиала"        , СокрЛП(Константы.КодФилиала.Получить())); 
		
	КонецЕсли;	
	
	Попытка	
		
		//////Тестовое Подключение
		//////*******************
		//КонстантаАдрес = Константы.АдресВебСервисаУТ11.Получить();	
		//АдресВебСервиса = "http://" + КонстантаАдрес + "/ws/GoodsReserve.1cws?wsdl"; 
		//АдресВебСервиса = "http://192.168.0.170/ws/GoodsReserve.1cws?wsdl";
		//ВСОпределение = Новый WSОпределения(АдресВебСервиса, , ,,30);
		//ВСОпределение = Новый WSОпределения(АдресВебСервиса, "webadmin", "web",, 30);
		//ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "GoodsReserve", "GoodsReserveSoap");
		//ВСПрокси.Пользователь = "webadmin";
		//ВСПрокси.Пароль = "web"; 
		//*******************
		
		//Для рабочего состояния
		ВСПрокси = МСКWEB.СоздатьПодключение(Истина);    
		
		Данные = МСКWEB.ДанныеВJSONХранилище(СтруктураПараметров);
		ЗаписьЖурналаРегистрации("Отправка Служебной записки в УТ11", УровеньЖурналаРегистрации.Информация,,, "GoodsReserve.СоздатьИнвойсПоТранзиту4");
		
		Ответ = ВСПрокси.СоздатьИнвойсПоТранзиту4(Данные); 
		
		ДанныеОтвета = МСКWEB.ХранилищеJSONВСтруктуру(Ответ); 
		
		ТекстОшибкиОтправки = "";
		
		Если ТипЗнч(ДанныеОтвета) = Тип("Структура") Тогда	
			
			Если ДанныеОтвета.Загружен Тогда    
				
				СтруктураВозврата.Вставить("НомерИнвойс", ДанныеОтвета.НомерДокументаУТ11);
				
				Если ДанныеОтвета.Свойство("НомерАктаПриемкиТовараНаЭкспертизуУТ11") Тогда
					СтруктураВозврата.Вставить("НомерАктаПриемкиТовараНаЭкспертизуУТ11", ДанныеОтвета.НомерАктаПриемкиТовараНаЭкспертизуУТ11);
				КонецЕсли;

			Иначе                                           
				
				СтруктураВозврата.Вставить("Отказ", Истина);
				Сообщить("Ошибка отправки: 
				|" + ДанныеОтвета.ОписаниеОшибки, СтатусСообщения.Важное);
				
				ТекстОшибкиОтправки = "Ошибка отправки: " + ДанныеОтвета.ОписаниеОшибки;
				
			КонецЕсли;
			
		КонецЕсли; 
		
		Если Не ПустаяСтрока(ТекстОшибкиОтправки) Тогда
			ЗаписьЖурналаРегистрации("Получен ответ после отправки Служебной записки в УТ11. " + ТекстОшибкиОтправки, 
			УровеньЖурналаРегистрации.Ошибка,,, "GoodsReserve.СоздатьИнвойсПоТранзиту4");
		Иначе	
			ЗаписьЖурналаРегистрации("Получен ответ после отправки Служебной записки в УТ11", УровеньЖурналаРегистрации.Информация,,, "GoodsReserve.СоздатьИнвойсПоТранзиту4");
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Ошибка получения ответа после отправки Служебной записки в УТ11", УровеньЖурналаРегистрации.Ошибка,,, 
		"GoodsReserve.СоздатьИнвойсПоТранзиту4 " + ОписаниеОшибки());
		
		Сообщить(ОписаниеОшибки());
		
		РаботаСАвардой.СоздатьОповещениеОбОшибкеОтправкиВАварду("Ошибка получения ответа после отправки Служебной записки в УТ11",
		"GoodsReserve.СоздатьИнвойсПоТранзиту4 " + ОписаниеОшибки());
		
		СтруктураВозврата.Вставить("Отказ", Истина);
		
	КонецПопытки; 
	
	Возврат СтруктураВозврата;
	
КонецФункции	

Функция ТаблицуВМассив(Таблица)

	МассивДанных = Новый Массив;
	
	Для Каждого ТекСтрока Из Таблица Цикл
		
		СтруктураДанных = Новый Структура;
		
		Для Каждого Колонка ИЗ Таблица.Колонки Цикл
			
			Если ЭтоСсылка(ТекСтрока[Колонка.Имя]) Тогда
				
				Если Колонка.Имя = "Номенклатура" ИЛИ Колонка.Имя = "Ссылка" ИЛИ Колонка.Имя = "Заказ" ИЛИ Колонка.Имя = "ЗаказПокупателя" Тогда
					СтруктураДанных.Вставить(Колонка.Имя, ?(ТекСтрока[Колонка.Имя] = NULL, "", Строка(ТекСтрока[Колонка.Имя].УникальныйИдентификатор())));
				Иначе
					СтруктураДанных.Вставить(Колонка.Имя, Строка(ТекСтрока[Колонка.Имя]));
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ТекСтрока[Колонка.Имя]) = Тип("Дата") Тогда
				СтруктураДанных.Вставить(Колонка.Имя, Строка(ТекСтрока[Колонка.Имя]));
			Иначе
				СтруктураДанных.Вставить(Колонка.Имя, ТекСтрока[Колонка.Имя]);
			КонецЕсли;
			
		КонецЦикла;
		
		МассивДанных.Добавить(СтруктураДанных);
		
	КонецЦикла;         
	
	Возврат МассивДанных;

КонецФункции

Функция ЭтоСсылка(Значение)

	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Строка") ИЛИ ТипЗнч(Значение) = Тип("Дата") 
		ИЛИ ТипЗнч(Значение) = Тип("Булево") ИЛИ ТипЗнч(Значение) = Тип("Структура") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Процедура ОтправитьПисьмоВОтделРекламации(ДокументСсылка) Экспорт 

	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();								
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	
	Почта = Новый ИнтернетПочта; 
	ОтправитьПочту = Истина;
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение		
		ЗаписьЖурналаРегистрации("Отправка письма в отдел рекламации",УровеньЖурналаРегистрации.Ошибка,,,
		"Не удалось подключиться к почтовому серверу!");
		ОтправитьПочту = Ложь;
	КонецПопытки;
	
	Если ОтправитьПочту Тогда 
		
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		
		АдресЭлПочты = МСК.ПолучитьЭлектронныйАдрес(ДокументСсылка.Получатель);
		
		Если Не ПустаяСтрока(АдресЭлПочты)  Тогда 
			
			МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(АдресЭлПочты, ";");
			
			Для каждого ТекАдрес Из МассивАдресов Цикл
				Сообщение.Получатели.Добавить(ТекАдрес);                                                                                 
			КонецЦикла;

		Иначе
			ЗаписьЖурналаРегистрации("Отправка письма в отдел рекламации",УровеньЖурналаРегистрации.Ошибка,,,
			"Не заполнен 'Адрес электронной почты контрагента для обмена электронными документами' у контрагнета " + СокрЛП(ДокументСсылка.Получатель) + "");			
		КонецЕсли;
		
		Если Сообщение.Получатели.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Сообщение.Тема = "Уведомление об отправке товаров на экспертизу из филиала " + СокрЛП(Константы.База.Получить());
		
		Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
		
		ТекстПоТоварам = "";
		
		Для Каждого СтрокаТовары Из ДокументСсылка.ЗаявкаНаВозврат.Товары Цикл
			
			ТекстПоТоварам = ТекстПоТоварам +?(ТекстПоТоварам = "","",Символы.ПС) + СокрЛП(СтрокаТовары.Номенклатура.Артикул) + ", " 
			+ "'" + СокрЛП(СтрокаТовары.Номенклатура.Наименование) + "', "
			+ СокрЛП(СтрокаТовары.Номенклатура.Родитель.Наименование) + ", "
			+ СокрЛП(СтрокаТовары.Номенклатура.КодПроизводителя) + ", "
			+ "кол. " + СокрЛП(СтрокаТовары.Количество) + " шт., "
			+ "цена " + СокрЛП(СтрокаТовары.Цена) + ", "
			+ "сумма " + СокрЛП(СтрокаТовары.Сумма);													   
			
		КонецЦикла;	
		
		ТекстТелаПисьма = "Уведомляем вас, что " + Формат(ДокументСсылка.ЗаданиеНаДоставку.Дата, "ДФ=dd.MM.yyyy") + " из филиала " + СокрЛП(Константы.База.Получить())
		                + " был оправлен на экспертизу товар <br>
		|" + ТекстПоТоварам + "<br>
		|принятый от клиента по заявке на возврат " + СокрЛП(ДокументСсылка.ЗаявкаНаВозврат.Номер) + " от " + Формат(ДокументСсылка.ЗаявкаНаВозврат.Дата, "ДФ=dd.MM.yyyy") + ".<br>
		|Товар был отправлен с водителем " + СокрЛП(ДокументСсылка.ЗаданиеНаДоставку.Водитель) 
		+ ?(ЗначениеЗаполнено(ДокументСсылка.ЗаданиеНаДоставку.Автомобиль), " , автомобиль г/н " + СокрЛП(ДокументСсылка.ЗаданиеНаДоставку.Автомобиль.РегистрационныйНомер), "") + "<br>
		|Для передачи экспертизного товара в УТ11 был создан инвойс " + СокрЛП(ДокументСсылка.НомерИнвойс) + " и Акт приемки товаров на экспертизу "
		+ СокрЛП(ДокументСсылка.НомерАктаПриемкиТовараНаЭкспертизу) + "";
		
		Сообщение.Тексты.Добавить(ТекстТелаПисьма, ТипТекстаПочтовогоСообщения.HTML);
		
		Почта.Послать(Сообщение);
		Сообщение.Получатели.Очистить();
		
		Почта.Отключиться();
		
		ЗаписьЖурналаРегистрации("Отправка письма в отдел рекламации", УровеньЖурналаРегистрации.Информация,,,
		"Отправлено письмо по адресу: " + АдресЭлПочты +
		" с информацией об отправке товаров по служ.записке " + СокрЛП(ДокументСсылка.Номер));	
		
	КонецЕсли;
	
КонецПроцедуры
